
## :x: Apply Failed

[CI link](https://github.com/hayas1/tfgh/actions/runs/13011000488)



<pre><code>Error: POST https://api.github.com/repos/hayas1/go-fluffy-json/git/refs: 422 Reference already exists []

  with module.repositories[&#34;go-fluffy-json&#34;].github_repository_file.this[&#34;github/pull_request_template.md&#34;],
  on module/repository/files.tf line 12, in resource &#34;github_repository_file&#34; &#34;this&#34;:
  12: resource &#34;github_repository_file&#34; &#34;this&#34; {


Error: POST https://api.github.com/repos/hayas1/go-fluffy-json/git/refs: 422 Reference already exists []

  with module.repositories[&#34;go-fluffy-json&#34;].github_repository_file.this[&#34;github/workflows/labeler.yml&#34;],
  on module/repository/files.tf line 12, in resource &#34;github_repository_file&#34; &#34;this&#34;:
  12: resource &#34;github_repository_file&#34; &#34;this&#34; {

::error::Terraform exited with code 1.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
module.repositories["devcontainer-features"].github_repository.this: Refreshing state... [id=devcontainer-features]
module.repositories["relentless"].github_repository.this: Refreshing state... [id=relentless]
module.repositories["go-fluffy-json"].github_repository.this: Refreshing state... [id=go-fluffy-json]
module.repositories["dyson-rs"].github_repository.this: Refreshing state... [id=dyson-rs]
module.repositories["json-with-comments"].github_repository.this: Refreshing state... [id=json-with-comments]
module.repositories["tfgh"].github_repository.this: Refreshing state... [id=tfgh]
module.repositories["tokei-toukei"].github_repository.this: Refreshing state... [id=tokei-toukei]
module.repositories["json-with-comments"].github_repository_ruleset.this: Refreshing state... [id=2629668]
module.repositories["tokei-toukei"].github_repository_ruleset.this: Refreshing state... [id=2639488]
module.repositories["relentless"].github_repository_ruleset.this: Refreshing state... [id=2653838]
module.repositories["dyson-rs"].github_repository_ruleset.this: Refreshing state... [id=2589508]
module.repositories["devcontainer-features"].github_repository_ruleset.this: Refreshing state... [id=2602488]
module.repositories["tfgh"].github_repository_ruleset.this: Refreshing state... [id=2558597]
module.repositories["dyson-rs"].github_branch_default.this: Refreshing state... [id=dyson-rs]
module.repositories["devcontainer-features"].github_branch_default.this: Refreshing state... [id=devcontainer-features]
module.repositories["tfgh"].github_branch_default.this: Refreshing state... [id=tfgh]
module.repositories["go-fluffy-json"].github_branch_default.this: Refreshing state... [id=go-fluffy-json]
module.repositories["json-with-comments"].github_branch_default.this: Refreshing state... [id=json-with-comments]
module.repositories["relentless"].github_branch_default.this: Refreshing state... [id=relentless]
module.repositories["tokei-toukei"].github_branch_default.this: Refreshing state... [id=tokei-toukei]
module.repositories["devcontainer-features"].github_issue_label.this["deps"]: Refreshing state... [id=devcontainer-features:deps]
module.repositories["relentless"].github_issue_label.this["bugfix"]: Refreshing state... [id=relentless:bugfix]
module.repositories["dyson-rs"].github_issue_label.this["feature"]: Refreshing state... [id=dyson-rs:feature]
module.repositories["dyson-rs"].github_issue_label.this["breaking"]: Refreshing state... [id=dyson-rs:breaking]
module.repositories["tfgh"].github_issue_label.this["breaking"]: Refreshing state... [id=tfgh:breaking]
module.repositories["json-with-comments"].github_issue_label.this["refactor"]: Refreshing state... [id=json-with-comments:refactor]
module.repositories["dyson-rs"].github_issue_label.this["bugfix"]: Refreshing state... [id=dyson-rs:bugfix]
module.repositories["json-with-comments"].github_issue_label.this["bugfix"]: Refreshing state... [id=json-with-comments:bugfix]
module.repositories["tokei-toukei"].github_issue_label.this["bugfix"]: Refreshing state... [id=tokei-toukei:bugfix]
module.repositories["devcontainer-features"].github_issue_label.this["documentation"]: Refreshing state... [id=devcontainer-features:documentation]
module.repositories["relentless"].github_issue_label.this["documentation"]: Refreshing state... [id=relentless:documentation]
module.repositories["devcontainer-features"].github_issue_label.this["feature"]: Refreshing state... [id=devcontainer-features:feature]
module.repositories["relentless"].github_issue_label.this["maintenance"]: Refreshing state... [id=relentless:maintenance]
module.repositories["devcontainer-features"].github_issue_label.this["breaking"]: Refreshing state... [id=devcontainer-features:breaking]
module.repositories["json-with-comments"].github_issue_label.this["breaking"]: Refreshing state... [id=json-with-comments:breaking]
module.repositories["dyson-rs"].github_issue_label.this["maintenance"]: Refreshing state... [id=dyson-rs:maintenance]
module.repositories["relentless"].github_issue_label.this["deps"]: Refreshing state... [id=relentless:deps]
module.repositories["relentless"].github_issue_label.this["feature"]: Refreshing state... [id=relentless:feature]
module.repositories["json-with-comments"].github_issue_label.this["maintenance"]: Refreshing state... [id=json-with-comments:maintenance]
module.repositories["tokei-toukei"].github_issue_label.this["feature"]: Refreshing state... [id=tokei-toukei:feature]
module.repositories["devcontainer-features"].github_issue_label.this["refactor"]: Refreshing state... [id=devcontainer-features:refactor]
module.repositories["dyson-rs"].github_issue_label.this["refactor"]: Refreshing state... [id=dyson-rs:refactor]
module.repositories["tfgh"].github_issue_label.this["refactor"]: Refreshing state... [id=tfgh:refactor]
module.repositories["tfgh"].github_issue_label.this["documentation"]: Refreshing state... [id=tfgh:documentation]
module.repositories["json-with-comments"].github_issue_label.this["documentation"]: Refreshing state... [id=json-with-comments:documentation]
module.repositories["dyson-rs"].github_issue_label.this["documentation"]: Refreshing state... [id=dyson-rs:documentation]
module.repositories["dyson-rs"].github_issue_label.this["deps"]: Refreshing state... [id=dyson-rs:deps]
module.repositories["json-with-comments"].github_issue_label.this["feature"]: Refreshing state... [id=json-with-comments:feature]
module.repositories["tfgh"].github_issue_label.this["maintenance"]: Refreshing state... [id=tfgh:maintenance]
module.repositories["relentless"].github_issue_label.this["refactor"]: Refreshing state... [id=relentless:refactor]
module.repositories["tokei-toukei"].github_issue_label.this["refactor"]: Refreshing state... [id=tokei-toukei:refactor]
module.repositories["tokei-toukei"].github_issue_label.this["documentation"]: Refreshing state... [id=tokei-toukei:documentation]
module.repositories["relentless"].github_issue_label.this["breaking"]: Refreshing state... [id=relentless:breaking]
module.repositories["devcontainer-features"].github_issue_label.this["maintenance"]: Refreshing state... [id=devcontainer-features:maintenance]
module.repositories["tfgh"].github_issue_label.this["bugfix"]: Refreshing state... [id=tfgh:bugfix]
module.repositories["tfgh"].github_issue_label.this["deps"]: Refreshing state... [id=tfgh:deps]
module.repositories["tokei-toukei"].github_issue_label.this["maintenance"]: Refreshing state... [id=tokei-toukei:maintenance]
module.repositories["json-with-comments"].github_issue_label.this["deps"]: Refreshing state... [id=json-with-comments:deps]
module.repositories["devcontainer-features"].github_issue_label.this["bugfix"]: Refreshing state... [id=devcontainer-features:bugfix]
module.repositories["tokei-toukei"].github_issue_label.this["deps"]: Refreshing state... [id=tokei-toukei:deps]
module.repositories["tokei-toukei"].github_issue_label.this["breaking"]: Refreshing state... [id=tokei-toukei:breaking]
module.repositories["tfgh"].github_issue_label.this["feature"]: Refreshing state... [id=tfgh:feature]
module.repositories["relentless"].github_repository_file.this["github/pull_request_template.md"]: Refreshing state... [id=relentless/.github/pull_request_template.md]
module.repositories["tokei-toukei"].github_repository_file.this["github/labeler.yml"]: Refreshing state... [id=tokei-toukei/.github/labeler.yml]
module.repositories["devcontainer-features"].github_repository_file.this["github/release.yml"]: Refreshing state... [id=devcontainer-features/.github/release.yml]
module.repositories["tokei-toukei"].github_repository_file.this["github/issue_template.md"]: Refreshing state... [id=tokei-toukei/.github/issue_template.md]
module.repositories["dyson-rs"].github_repository_file.this["github/workflows/labeler.yml"]: Refreshing state... [id=dyson-rs/.github/workflows/labeler.yml]
module.repositories["tokei-toukei"].github_repository_file.this["github/release.yml"]: Refreshing state... [id=tokei-toukei/.github/release.yml]
module.repositories["tfgh"].github_repository_file.this["github/issue_template.md"]: Refreshing state... [id=tfgh/.github/issue_template.md]
module.repositories["json-with-comments"].github_repository_file.this["github/workflows/labeler.yml"]: Refreshing state... [id=json-with-comments/.github/workflows/labeler.yml]
module.repositories["devcontainer-features"].github_repository_file.this["github/issue_template.md"]: Refreshing state... [id=devcontainer-features/.github/issue_template.md]
module.repositories["tfgh"].github_repository_file.this["github/pull_request_template.md"]: Refreshing state... [id=tfgh/.github/pull_request_template.md]
module.repositories["devcontainer-features"].github_repository_file.this["github/labeler.yml"]: Refreshing state... [id=devcontainer-features/.github/labeler.yml]
module.repositories["tfgh"].github_repository_file.this["github/release.yml"]: Refreshing state... [id=tfgh/.github/release.yml]
module.repositories["dyson-rs"].github_repository_file.this["github/pull_request_template.md"]: Refreshing state... [id=dyson-rs/.github/pull_request_template.md]
module.repositories["devcontainer-features"].github_repository_file.this["github/pull_request_template.md"]: Refreshing state... [id=devcontainer-features/.github/pull_request_template.md]
module.repositories["json-with-comments"].github_repository_file.this["github/release.yml"]: Refreshing state... [id=json-with-comments/.github/release.yml]
module.repositories["relentless"].github_repository_file.this["github/labeler.yml"]: Refreshing state... [id=relentless/.github/labeler.yml]
module.repositories["dyson-rs"].github_repository_file.this["github/release.yml"]: Refreshing state... [id=dyson-rs/.github/release.yml]
module.repositories["dyson-rs"].github_repository_file.this["github/labeler.yml"]: Refreshing state... [id=dyson-rs/.github/labeler.yml]
module.repositories["json-with-comments"].github_repository_file.this["github/pull_request_template.md"]: Refreshing state... [id=json-with-comments/.github/pull_request_template.md]
module.repositories["tfgh"].github_repository_file.this["github/workflows/labeler.yml"]: Refreshing state... [id=tfgh/.github/workflows/labeler.yml]
module.repositories["relentless"].github_repository_file.this["github/release.yml"]: Refreshing state... [id=relentless/.github/release.yml]
module.repositories["json-with-comments"].github_repository_file.this["github/issue_template.md"]: Refreshing state... [id=json-with-comments/.github/issue_template.md]
module.repositories["tokei-toukei"].github_repository_file.this["github/workflows/labeler.yml"]: Refreshing state... [id=tokei-toukei/.github/workflows/labeler.yml]
module.repositories["relentless"].github_repository_file.this["github/workflows/labeler.yml"]: Refreshing state... [id=relentless/.github/workflows/labeler.yml]
module.repositories["devcontainer-features"].github_repository_file.this["github/workflows/labeler.yml"]: Refreshing state... [id=devcontainer-features/.github/workflows/labeler.yml]
module.repositories["json-with-comments"].github_repository_file.this["github/labeler.yml"]: Refreshing state... [id=json-with-comments/.github/labeler.yml]
module.repositories["tfgh"].github_repository_file.this["github/labeler.yml"]: Refreshing state... [id=tfgh/.github/labeler.yml]
module.repositories["dyson-rs"].github_repository_file.this["github/issue_template.md"]: Refreshing state... [id=dyson-rs/.github/issue_template.md]
module.repositories["tokei-toukei"].github_repository_file.this["github/pull_request_template.md"]: Refreshing state... [id=tokei-toukei/.github/pull_request_template.md]
module.repositories["relentless"].github_repository_file.this["github/issue_template.md"]: Refreshing state... [id=relentless/.github/issue_template.md]
module.repositories["json-with-comments"].github_repository_pull_request.managed: Refreshing state... [id=hayas1:json-with-comments:48]
module.repositories["tfgh"].github_repository_pull_request.managed: Refreshing state... [id=hayas1:tfgh:80]
module.repositories["tokei-toukei"].github_repository_pull_request.managed: Refreshing state... [id=hayas1:tokei-toukei:29]
module.repositories["relentless"].github_repository_pull_request.managed: Refreshing state... [id=hayas1:relentless:28]
module.repositories["devcontainer-features"].github_repository_pull_request.managed: Refreshing state... [id=hayas1:devcontainer-features:45]
module.repositories["dyson-rs"].github_repository_pull_request.managed: Refreshing state... [id=hayas1:dyson-rs:13]
github_issue_label.manual: Refreshing state... [id=tfgh:manual]
github_repository_environment.plan: Refreshing state... [id=tfgh:plan]
github_repository_environment.apply: Refreshing state... [id=tfgh:apply]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.repositories["devcontainer-features"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"9a7a65f8cd8b7e57a46590c8f80f06d6cf78e86cc20a7ae4d4db31a2c494c939\"" -> "W/\"afa29faec71c9113150c87481c980acf4ba819266781955a9cd08ba65168fb8b\""
        id                          = "devcontainer-features"
        name                        = "devcontainer-features"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repositories["dyson-rs"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"9f20dca849d24bc8404856e85415af4bc1f6e64f14ac8c2273d2ede4b9787d29\"" -> "W/\"71ea00f2c7526887b46c8b43eaa56b6c902d4940fee2c04611383b41fbe053ac\""
        id                          = "dyson-rs"
        name                        = "dyson-rs"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repositories["go-fluffy-json"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"20c89156c2163dabd245d84465a13e44f751dfd03fd26276ad450d86a6b1ce53\"" -> "W/\"f8234cf7005c1e751d63513146ce2d24066205d21d3ce840afafb2ab0499c84d\""
        id                          = "go-fluffy-json"
        name                        = "go-fluffy-json"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repositories["json-with-comments"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"5771e20347ad85054305bdbf7743c6884a8b700e8c98d142dcfc3c81ef973466\"" -> "W/\"aa28ad6e2f9e74fdb2c6c81ae4506f8402724eed5d368cc393fc46dd163d618d\""
        id                          = "json-with-comments"
        name                        = "json-with-comments"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repositories["relentless"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ description                 = "Relentless HTTP load testing / comparison testing tool" -> "Relentless load testing and comparison testing tool for HTTP / GRPC"
      ~ etag                        = "W/\"59ecb16387c7fc0bfb090a71cd1799077124c86c3a3378c6f49f162e4207e472\"" -> "W/\"1ba31dfa21e74db9c2572345456bc0fcf48ad76e09419f5bc3bed60c85e2c0e1\""
        id                          = "relentless"
        name                        = "relentless"
        # (34 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repositories["tfgh"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"2ab54d3b766d74fdd334f023d2c24874a23547d91d862fae21801731f0c344ef\"" -> "W/\"aebb8bbd34e5b944c2352ad3b5f7aa19186e9ec526d3e124e7a5806ab94c4b0e\""
        id                          = "tfgh"
        name                        = "tfgh"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repositories["tokei-toukei"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"975a6b112b25217473e9b4e2e55d0c4f1a5b48e7645b5575d64aec6a7eb2e32d\"" -> "W/\"28df412a9f712060447af81213bcc3eadc1e5b495b0f4ba227b21ff54c61d42d\""
        id                          = "tokei-toukei"
        name                        = "tokei-toukei"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.repositories["go-fluffy-json"].github_issue_label.this["breaking"] will be created
  + resource "github_issue_label" "this" {
      + color       = "F84AD4"
      + description = "Containing breaking changes"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "breaking"
      + repository  = "go-fluffy-json"
      + url         = (known after apply)
    }

  # module.repositories["go-fluffy-json"].github_issue_label.this["bugfix"] will be created
  + resource "github_issue_label" "this" {
      + color       = "DE3659"
      + description = "Fix some bugs"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "bugfix"
      + repository  = "go-fluffy-json"
      + url         = (known after apply)
    }

  # module.repositories["go-fluffy-json"].github_issue_label.this["deps"] will be created
  + resource "github_issue_label" "this" {
      + color       = "36BF46"
      + description = "Dependency updates"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "deps"
      + repository  = "go-fluffy-json"
      + url         = (known after apply)
    }

  # module.repositories["go-fluffy-json"].github_issue_label.this["documentation"] will be created
  + resource "github_issue_label" "this" {
      + color       = "0075CA"
      + description = "Documentation"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "documentation"
      + repository  = "go-fluffy-json"
      + url         = (known after apply)
    }

  # module.repositories["go-fluffy-json"].github_issue_label.this["feature"] will be created
  + resource "github_issue_label" "this" {
      + color       = "008B75"
      + description = "New feature"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "feature"
      + repository  = "go-fluffy-json"
      + url         = (known after apply)
    }

  # module.repositories["go-fluffy-json"].github_issue_label.this["maintenance"] will be created
  + resource "github_issue_label" "this" {
      + color       = "7F6054"
      + description = "No effect on codebase"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "maintenance"
      + repository  = "go-fluffy-json"
      + url         = (known after apply)
    }

  # module.repositories["go-fluffy-json"].github_issue_label.this["refactor"] will be created
  + resource "github_issue_label" "this" {
      + color       = "BA5798"
      + description = "Refactoring"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "refactor"
      + repository  = "go-fluffy-json"
      + url         = (known after apply)
    }

  # module.repositories["go-fluffy-json"].github_repository.this will be updated in-place
  ~ resource "github_repository" "this" {
      ~ auto_init                   = false -> true
      ~ delete_branch_on_merge      = false -> true
      - has_downloads               = true -> null
      - has_projects                = true -> null
      - has_wiki                    = true -> null
        id                          = "go-fluffy-json"
        name                        = "go-fluffy-json"
        # (31 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repositories["go-fluffy-json"].github_repository_file.this["github/issue_template.md"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "main"
      + autocreate_branch_source_sha    = (known after apply)
      + branch                          = "chore/managed-by-terraform"
      + commit_message                  = "Managed by Terraform: .github/issue_template.md"
      + commit_sha                      = (known after apply)
      + content                         = <<-EOT
            <!-- This template is managed by terraform. https://github.com/hayas1/tfgh -->
            
            ## Expectation :butterfly:
            > [Delete me] What behavior is expected?
            
            ## Reality :bug:
            > [Delete me] How does it actually work?
            
            ## Environment :evergreen_tree:
            > [Delete me] (When and) Where the behavior was observed?
            
            ## Cause :mag:
            > [Delete me] Why this issue was occurred?
            
            ## Related :chains:
            > [Delete me] The list of related issues or pull requests
            
            ## Remark :eyes:
            > [Delete me] Any remarks
        EOT
      + file                            = ".github/issue_template.md"
      + id                              = (known after apply)
      + overwrite_on_create             = true
      + ref                             = (known after apply)
      + repository                      = "go-fluffy-json"
      + sha                             = (known after apply)
    }

  # module.repositories["go-fluffy-json"].github_repository_file.this["github/labeler.yml"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "main"
      + autocreate_branch_source_sha    = (known after apply)
      + branch                          = "chore/managed-by-terraform"
      + commit_message                  = "Managed by Terraform: .github/labeler.yml"
      + commit_sha                      = (known after apply)
      + content                         = <<-EOT
            # Managed by terraform. https://github.com/hayas1/tfgh
            
            feature:
              - head-branch:
                - '^feat/'
                - '^feature/'
            
            breaking:
              - head-branch:
                - '^breaking/'
            
            bugfix:
              - head-branch:
                - '^fix/'
                - '^bugfix/'
                - '^modify/'
            
            refactor:
              - head-branch:
                - '^refactor/'
            
            documentation:
              - changed-files:
                - any-glob-to-any-file:
                  - '**/README.md'
              - head-branch:
                - '^doc/'
                - '^docs/'
                - '^documentation/'
            
            deps:
              - head-branch:
                - '^dep/'
                - '^deps/'
                - '^dependencies/'
            
            maintenance:
              - changed-files:
                - any-glob-to-any-file:
                  - '.github/**'
              - head-branch:
                - '^maintenance/'
                - '^ci/'
                - '^workflow/'
                - '^chore/'
        EOT
      + file                            = ".github/labeler.yml"
      + id                              = (known after apply)
      + overwrite_on_create             = true
      + ref                             = (known after apply)
      + repository                      = "go-fluffy-json"
      + sha                             = (known after apply)
    }

  # module.repositories["go-fluffy-json"].github_repository_file.this["github/pull_request_template.md"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "main"
      + autocreate_branch_source_sha    = (known after apply)
      + branch                          = "chore/managed-by-terraform"
      + commit_message                  = "Managed by Terraform: .github/pull_request_template.md"
      + commit_sha                      = (known after apply)
      + content                         = <<-EOT
            <!-- This template is managed by terraform. https://github.com/hayas1/tfgh -->
            
            ## Overview :rocket:
            > [Delete me] What is this pull request?
            
            ## Implementation :clamp:
            > [Delete me] How to realize ?
            
            ## Use cases :chopsticks:
            > [Delete me] Why this pull request was created?
            
            ## Testing :gear:
            > [Delete me] Testing steps
            
            ## Related :chains:
            > [Delete me] The list of related issues or pull requests
            
            ## Remark :eyes:
            > [Delete me] Any remarks
        EOT
      + file                            = ".github/pull_request_template.md"
      + id                              = (known after apply)
      + overwrite_on_create             = true
      + ref                             = (known after apply)
      + repository                      = "go-fluffy-json"
      + sha                             = (known after apply)
    }

  # module.repositories["go-fluffy-json"].github_repository_file.this["github/release.yml"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "main"
      + autocreate_branch_source_sha    = (known after apply)
      + branch                          = "chore/managed-by-terraform"
      + commit_message                  = "Managed by Terraform: .github/release.yml"
      + commit_sha                      = (known after apply)
      + content                         = <<-EOT
            # Managed by terraform. https://github.com/hayas1/tfgh
            
            changelog:
              categories:
                - title: '🚀 Features'
                  labels:
                    - feature
                - title: '🔨 Breaking Changes'
                  labels:
                    - breaking
                - title: '🐛 Bug Fixes'
                  labels:
                    - bugfix
                - title: '🔧 Refactoring'
                  labels:
                    - refactor
                - title: '📖 Documentation'
                  labels:
                    - documentation
                - title: '👒 Dependency update'
                  labels:
                    - deps
                - title: '🧰 Maintenance'
                  labels:
                    - maintenance
                - title: Other Changes
                  labels:
                    - "*"
        EOT
      + file                            = ".github/release.yml"
      + id                              = (known after apply)
      + overwrite_on_create             = true
      + ref                             = (known after apply)
      + repository                      = "go-fluffy-json"
      + sha                             = (known after apply)
    }

  # module.repositories["go-fluffy-json"].github_repository_file.this["github/workflows/labeler.yml"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "main"
      + autocreate_branch_source_sha    = (known after apply)
      + branch                          = "chore/managed-by-terraform"
      + commit_message                  = "Managed by Terraform: .github/workflows/labeler.yml"
      + commit_sha                      = (known after apply)
      + content                         = <<-EOT
            # Managed by terraform. https://github.com/hayas1/tfgh
            
            name: Pull Request Labeler
            on:
            - pull_request_target
            
            jobs:
              labeler:
                permissions:
                  contents: read
                  pull-requests: write
                runs-on: ubuntu-latest
                steps:
                - uses: actions/labeler@v5
        EOT
      + file                            = ".github/workflows/labeler.yml"
      + id                              = (known after apply)
      + overwrite_on_create             = true
      + ref                             = (known after apply)
      + repository                      = "go-fluffy-json"
      + sha                             = (known after apply)
    }

  # module.repositories["go-fluffy-json"].github_repository_pull_request.managed will be created
  + resource "github_repository_pull_request" "managed" {
      + base_ref              = "main"
      + base_repository       = "go-fluffy-json"
      + base_sha              = (known after apply)
      + body                  = <<-EOT
            - .github/issue_template.md
            - .github/labeler.yml
            - .github/pull_request_template.md
            - .github/release.yml
            - .github/workflows/labeler.yml
        EOT
      + draft                 = (known after apply)
      + head_ref              = "chore/managed-by-terraform"
      + head_sha              = (known after apply)
      + id                    = (known after apply)
      + labels                = (known after apply)
      + maintainer_can_modify = false
      + number                = (known after apply)
      + opened_at             = (known after apply)
      + opened_by             = (known after apply)
      + state                 = (known after apply)
      + title                 = "[auto] snippet files managed by Terraform"
      + updated_at            = (known after apply)
    }

  # module.repositories["go-fluffy-json"].github_repository_ruleset.this will be created
  + resource "github_repository_ruleset" "this" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "default"
      + node_id     = (known after apply)
      + repository  = "go-fluffy-json"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + bypass_actors {
          + actor_id    = 5
          + actor_type  = "RepositoryRole"
          + bypass_mode = "pull_request"
        }

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "~DEFAULT_BRANCH",
                ]
            }
        }

      + rules {
          + creation                      = true
          + deletion                      = true
          + non_fast_forward              = true
          + update_allows_fetch_and_merge = false

          + pull_request {
              + dismiss_stale_reviews_on_push     = false
              + require_code_owner_review         = false
              + require_last_push_approval        = false
              + required_approving_review_count   = 0
              + required_review_thread_resolution = false
            }
        }
    }

Plan: 14 to add, 1 to change, 0 to destroy.
module.repositories["go-fluffy-json"].github_repository.this: Modifying... [id=go-fluffy-json]
module.repositories["go-fluffy-json"].github_repository.this: Modifications complete after 2s [id=go-fluffy-json]
module.repositories["go-fluffy-json"].github_issue_label.this["maintenance"]: Creating...
module.repositories["go-fluffy-json"].github_issue_label.this["bugfix"]: Creating...
module.repositories["go-fluffy-json"].github_repository_ruleset.this: Creating...
module.repositories["go-fluffy-json"].github_repository_file.this["github/labeler.yml"]: Creating...
module.repositories["go-fluffy-json"].github_repository_file.this["github/pull_request_template.md"]: Creating...
module.repositories["go-fluffy-json"].github_issue_label.this["refactor"]: Creating...
module.repositories["go-fluffy-json"].github_issue_label.this["breaking"]: Creating...
module.repositories["go-fluffy-json"].github_repository_file.this["github/workflows/labeler.yml"]: Creating...
module.repositories["go-fluffy-json"].github_issue_label.this["documentation"]: Creating...
module.repositories["go-fluffy-json"].github_issue_label.this["feature"]: Creating...
module.repositories["go-fluffy-json"].github_repository_ruleset.this: Creation complete after 6s [id=3439359]
module.repositories["go-fluffy-json"].github_repository_file.this["github/release.yml"]: Creating...
module.repositories["go-fluffy-json"].github_issue_label.this["bugfix"]: Still creating... [10s elapsed]
module.repositories["go-fluffy-json"].github_repository_file.this["github/labeler.yml"]: Still creating... [10s elapsed]
module.repositories["go-fluffy-json"].github_issue_label.this["maintenance"]: Still creating... [10s elapsed]
module.repositories["go-fluffy-json"].github_repository_file.this["github/pull_request_template.md"]: Still creating... [10s elapsed]
module.repositories["go-fluffy-json"].github_repository_file.this["github/workflows/labeler.yml"]: Still creating... [10s elapsed]
module.repositories["go-fluffy-json"].github_issue_label.this["refactor"]: Still creating... [10s elapsed]
module.repositories["go-fluffy-json"].github_issue_label.this["breaking"]: Still creating... [10s elapsed]
module.repositories["go-fluffy-json"].github_issue_label.this["documentation"]: Still creating... [10s elapsed]
module.repositories["go-fluffy-json"].github_issue_label.this["feature"]: Still creating... [10s elapsed]
module.repositories["go-fluffy-json"].github_issue_label.this["bugfix"]: Creation complete after 10s [id=go-fluffy-json:bugfix]
module.repositories["go-fluffy-json"].github_issue_label.this["deps"]: Creating...
module.repositories["go-fluffy-json"].github_issue_label.this["maintenance"]: Creation complete after 10s [id=go-fluffy-json:maintenance]
module.repositories["go-fluffy-json"].github_repository_file.this["github/issue_template.md"]: Creating...
module.repositories["go-fluffy-json"].github_issue_label.this["breaking"]: Creation complete after 10s [id=go-fluffy-json:breaking]
module.repositories["go-fluffy-json"].github_issue_label.this["documentation"]: Creation complete after 14s [id=go-fluffy-json:documentation]
module.repositories["go-fluffy-json"].github_issue_label.this["refactor"]: Creation complete after 14s [id=go-fluffy-json:refactor]
module.repositories["go-fluffy-json"].github_issue_label.this["feature"]: Creation complete after 15s [id=go-fluffy-json:feature]
module.repositories["go-fluffy-json"].github_repository_file.this["github/release.yml"]: Still creating... [10s elapsed]
module.repositories["go-fluffy-json"].github_repository_file.this["github/labeler.yml"]: Still creating... [20s elapsed]
module.repositories["go-fluffy-json"].github_issue_label.this["deps"]: Creation complete after 10s [id=go-fluffy-json:deps]
module.repositories["go-fluffy-json"].github_repository_file.this["github/issue_template.md"]: Still creating... [10s elapsed]
module.repositories["go-fluffy-json"].github_repository_file.this["github/labeler.yml"]: Creation complete after 23s [id=go-fluffy-json/.github/labeler.yml]
module.repositories["go-fluffy-json"].github_repository_file.this["github/release.yml"]: Creation complete after 17s [id=go-fluffy-json/.github/release.yml]
module.repositories["go-fluffy-json"].github_repository_file.this["github/issue_template.md"]: Creation complete after 13s [id=go-fluffy-json/.github/issue_template.md]

Error: POST https://api.github.com/repos/hayas1/go-fluffy-json/git/refs: 422 Reference already exists []

  with module.repositories["go-fluffy-json"].github_repository_file.this["github/pull_request_template.md"],
  on module/repository/files.tf line 12, in resource "github_repository_file" "this":
  12: resource "github_repository_file" "this" {


Error: POST https://api.github.com/repos/hayas1/go-fluffy-json/git/refs: 422 Reference already exists []

  with module.repositories["go-fluffy-json"].github_repository_file.this["github/workflows/labeler.yml"],
  on module/repository/files.tf line 12, in resource "github_repository_file" "this":
  12: resource "github_repository_file" "this" {

::error::Terraform exited with code 1.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":82,"Program":"tfcmt","SHA1":"269241ab662e8aa5a43b6dfb8430ea2a2d8fdfbd","Vars":{},"WorkflowName":"Terraform apply on push"} -->